# 2. 파이썬으로 데이터 주무르기, pandas
**pandas를 활용해서 데이터프레임을 다뤄봅시다.**

1. Pandas 시작하기
    - prerequisite : Table
    - pandas import하기
   
2. Pandas로 1차원 데이터 다루기 - Series 
    - Series 선언하기
    - Series vs ndarray
    - Series vs dict
    - Series에 이름 붙이기
3. Pandas로 2차원 데이터 다루기 - dataframe
    - dataframe 선언하기
    - from csv to dataframe
    - dataframe 자료 접근하기

[수업에 사용된 covid 데이터](https://www.kaggle.com/imdevskp/corona-virus-report)

## I. pandas 시작하기

### Prerequsite: Table  
- 행과 열을 이용하여 데이터를 저장 및 관리하는 자료구조(컨테이너)
- 주로 행은 개체, 열은 속성을 나타냄

### Pandas 시작하기

import pandas를 통해서 진행

In [2]:
import pandas as pd

## II. pandas로 1차원 데이터 다루기 - Series

### Series

- 1차원 labeled **array**
- 인덱스를 지정할 수 있다

In [2]:
s  = pd.Series([1, 4, 9, 16, 25])

s

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [3]:
t = pd.Series({'one': 1, 'two': 2, 'three':3, 'four':4, 'five':5})

t

one      1
two      2
three    3
four     4
five     5
dtype: int64

### Series와 Numpy

- series는 numpy와 유사하다

In [5]:
s[1]

4

In [6]:
t[1]

2

In [7]:
t[1:3]

two      2
three    3
dtype: int64

In [8]:
s[s > s.median()]

3    16
4    25
dtype: int64

In [10]:
s[[3, 1, 4]]

3    16
1     4
4    25
dtype: int64

In [11]:
import numpy as np

np.exp(s)

0    2.718282e+00
1    5.459815e+01
2    8.103084e+03
3    8.886111e+06
4    7.200490e+10
dtype: float64

In [13]:
s.dtype

dtype('int64')

### Series와 Dictionary

- Series는 Dictionary와 유사한 특징을 갖는다.

In [15]:
t['one']

1

In [17]:
# Series에 값 추가
t['six'] = 6

t

one      1
two      2
three    3
four     4
five     5
six      6
dtype: int64

In [19]:
'six' in t

True

In [20]:
t.get('seven')

In [22]:
t.get('seven', 0) # seven에 해당하는 값을 찾고 만약 없다면 0을 반환

0

### Series에 이름 붙이기
- Series는 name속성을 가지고 있다.
- 처음 Series를 만들 때 이름을 붙일 수 있다.

In [25]:
s = pd.Series(np.random.randn(5), name='random_nums')

s

0   -1.494149
1   -1.636927
2   -0.720484
3   -0.654220
4    0.784519
Name: random_nums, dtype: float64

## III. Pandas로 2차원 데이터 다루기 - dataframe

### Dataframe
- 2차원 labeled table
- Index를 지정해줄 수 있다.

In [26]:
d = {'height': [150, 160, 170, 175], 'weight':[45, 50, 60, 80]}
df = pd.DataFrame(d)
df

   height  weight
0     150      45
1     160      50
2     170      60
3     175      80

In [27]:
## dtype 확인

df.dtypes

height    int64
weight    int64
dtype: object

### From CSV to DataFrame
- Comma Seperated Value를 DataFrame으로 생성해줄 수 있다.
- read_csv()를 사용

In [14]:
# 동일 경로에 csv파일이 존재한다면 
# covid = pd.read_csv("country_wise_latest.csv")

covid = pd.read_csv('/jupyter/Data/archive/country_wise_latest.csv')
covid

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
0,Afghanistan,36263,1269,25198,9796,106,10,18,3.50,69.49,5.04,35526,737,2.07,Eastern Mediterranean
1,Albania,4880,144,2745,1991,117,6,63,2.95,56.25,5.25,4171,709,17.00,Europe
2,Algeria,27973,1163,18837,7973,616,8,749,4.16,67.34,6.17,23691,4282,18.07,Africa
3,Andorra,907,52,803,52,10,0,0,5.73,88.53,6.48,884,23,2.60,Europe
4,Angola,950,41,242,667,18,1,0,4.32,25.47,16.94,749,201,26.84,Africa
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
182,West Bank and Gaza,10621,78,3752,6791,152,2,0,0.73,35.33,2.08,8916,1705,19.12,Eastern Mediterranean
183,Western Sahara,10,1,8,1,0,0,0,10.00,80.00,12.50,10,0,0.00,Africa
184,Yemen,1691,483,833,375,10,4,36,28.56,49.26,57.98,1619,72,4.45,Eastern Mediterranean
185,Zambia,4552,140,2815,1597,71,1,465,3.08,61.84,4.97,3326,1226,36.86,Africa
186,Zimbabwe,2704,36,542,2126,192,2,24,1.33,20.04,6.64,1713,991,57.85,Africa

### Pandas 활용 1 일부분만 관찰하기

In [32]:
# 위에서부터 5개를 관찰하는 방법(함수)

covid.head()

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
0,Afghanistan,36263,1269,25198,9796,106,10,18,3.50,69.49,5.04,35526,737,2.07,Eastern Mediterranean
1,Albania,4880,144,2745,1991,117,6,63,2.95,56.25,5.25,4171,709,17.00,Europe
2,Algeria,27973,1163,18837,7973,616,8,749,4.16,67.34,6.17,23691,4282,18.07,Africa
3,Andorra,907,52,803,52,10,0,0,5.73,88.53,6.48,884,23,2.60,Europe
4,Angola,950,41,242,667,18,1,0,4.32,25.47,16.94,749,201,26.84,Africa

In [33]:
# 마지막 N개의 데이터를 참조

covid.tail()

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
182,West Bank and Gaza,10621,78,3752,6791,152,2,0,0.73,35.33,2.08,8916,1705,19.12,Eastern Mediterranean
183,Western Sahara,10,1,8,1,0,0,0,10.00,80.00,12.50,10,0,0.00,Africa
184,Yemen,1691,483,833,375,10,4,36,28.56,49.26,57.98,1619,72,4.45,Eastern Mediterranean
185,Zambia,4552,140,2815,1597,71,1,465,3.08,61.84,4.97,3326,1226,36.86,Africa
186,Zimbabwe,2704,36,542,2126,192,2,24,1.33,20.04,6.64,1713,991,57.85,Africa

### Pandas 활용 2 데이터 접근하기
- `df['column_name']` or `df.column_name`

In [34]:
covid['Confirmed']

0      36263
1       4880
2      27973
3        907
4        950
       ...
182    10621
183       10
184     1691
185     4552
186     2704
Name: Confirmed, Length: 187, dtype: int64

In [36]:
covid.Confirmed # column_name에 공백 문자가 있는 경우 사용이 불가

0      36263
1       4880
2      27973
3        907
4        950
       ...
182    10621
183       10
184     1691
185     4552
186     2704
Name: Confirmed, Length: 187, dtype: int64

### 꿀팁 DataFrame의 각 column은 Series다

In [38]:
type(covid['Confirmed'])

pandas.core.series.Series

In [39]:
covid['Confirmed'][1:3]

1     4880
2    27973
Name: Confirmed, dtype: int64

### Pandas 활용 3 조건을 이용하여 데이터 접근하기

In [47]:
# 신규 확진자가 100명이 넘는 나라를 찾아보자

covid[covid['New cases']>100]['Country/Region']

0             Afghanistan
1                 Albania
2                 Algeria
6               Argentina
8               Australia
              ...
177        United Kingdom
179            Uzbekistan
180             Venezuela
182    West Bank and Gaza
186              Zimbabwe
Name: Country/Region, Length: 82, dtype: object

In [64]:
# WHO 지역이 동남아시아인 나라 찾기

print(covid['WHO Region'].unique())
covid[covid['WHO Region'] == 'Eastern Mediterranean']['Country/Region']

['Eastern Mediterranean' 'Europe' 'Africa' 'Americas' 'Western Pacific'
 'South-East Asia']

0               Afghanistan
12                  Bahrain
48                 Djibouti
52                    Egypt
81                     Iran
82                     Iraq
88                   Jordan
92                   Kuwait
96                  Lebanon
99                    Libya
116                 Morocco
127                    Oman
128                Pakistan
136                   Qatar
145            Saudi Arabia
153                 Somalia
159                   Sudan
163                   Syria
171                 Tunisia
176    United Arab Emirates
182      West Bank and Gaza
184                   Yemen
Name: Country/Region, dtype: object

### Pandas 활용 4 행을 기준으로 데이터 접근하기

In [65]:
# 예시 데이터 - 도서관 정보

books_dict = {'Available':[True, True, False], 'Location':[102, 215, 314], 'Genre':['Programming','Physics', 'Math']}
books_df = pd.DataFrame(books_dict, index=['컴퓨터책', '물리학책', '수학책'])
books_df

      Available  Location        Genre
컴퓨터책       True       102  Programming
물리학책       True       215      Physics
수학책       False       314         Math

### Index를 이용하여 가져오기: .`loc[row, col]`

In [67]:
books_df.loc["컴퓨터책"]

Available           True
Location             102
Genre        Programming
Name: 컴퓨터책, dtype: object

In [71]:
type(books_df.loc['컴퓨터책'])

pandas.core.series.Series

In [74]:
# 수학책이 대출 가능한지 알아보기

books_df.loc['수학책']['Available']
books_df.loc['수학책', 'Available']

False

### 숫자 인덱스를 이용하여 가져오기: .`iloc[row_index, col_index]`

In [75]:
# 인덱스 0행의 인덱스 1열

books_df.iloc[0, 1]

102

In [76]:
#인덱스 1행의 인덱스 0~1열

books_df.iloc[1, 0:2]

Available    True
Location      215
Name: 물리학책, dtype: object

### Pandas 활용 5 Groupby
- Split: 특정한 기준을 바탕으로 DataFrame을 분할
- Apply: 통계함수(sum(), mean(), median(), ...)를 적용하여 각 데이터를 압축
- Combine: Apply된 결과를 바탕으로 새로운 Series를 생성 (group_key: applied_value)

`groupby()`

In [77]:
covid.head()

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
0,Afghanistan,36263,1269,25198,9796,106,10,18,3.50,69.49,5.04,35526,737,2.07,Eastern Mediterranean
1,Albania,4880,144,2745,1991,117,6,63,2.95,56.25,5.25,4171,709,17.00,Europe
2,Algeria,27973,1163,18837,7973,616,8,749,4.16,67.34,6.17,23691,4282,18.07,Africa
3,Andorra,907,52,803,52,10,0,0,5.73,88.53,6.48,884,23,2.60,Europe
4,Angola,950,41,242,667,18,1,0,4.32,25.47,16.94,749,201,26.84,Africa

In [79]:
# WHO Region별 확진자 수

# 1. covid에서 확진자 수 column만 추출한다.
# 2. 이를 covid의 WHP Region을 기준으로 groupby한다.

covid_by_region = covid['Confirmed'].groupby(by=covid['WHO Region'])

covid_by_region # Split 과정만 적용된 상태

In [81]:
covid_by_region.sum() # Apply 과정 적용

WHO Region
Africa                    723207
Americas                 8839286
Eastern Mediterranean    1490744
Europe                   3299523
South-East Asia          1835297
Western Pacific           292428
Name: Confirmed, dtype: int64

In [82]:
# 국가당 감염자 수

covid_by_region.mean() # sum() / 국가 수

WHO Region
Africa                    15066.812500
Americas                 252551.028571
Eastern Mediterranean     67761.090909
Europe                    58920.053571
South-East Asia          183529.700000
Western Pacific           18276.750000
Name: Confirmed, dtype: float64

## Mission:
### 1. covid 데이터에서 100 case 대비 사망률(`Deaths / 100 Cases`)이 가장 높은 국가는?

In [89]:
covid[covid['Deaths / 100 Cases'] == covid['Deaths / 100 Cases'].max()]['Country/Region']

184    Yemen
Name: Country/Region, dtype: object

### 2. covid 데이터에서 신규 확진자가 없는 나라 중 WHO Region이 'Europe'를 모두 출력하면?  
Hint : 한 줄에 동시에 두가지 조건을 Apply하는 경우 Warning이 발생할 수 있습니다.

In [99]:
covid[(covid['New cases'] == 0) & (covid['WHO Region'] == 'Europe')]

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
56,Estonia,2034,69,1923,42,0,0,1,3.39,94.54,3.59,2021,13,0.64,Europe
75,Holy See,12,0,12,0,0,0,0,0.00,100.00,0.00,12,0,0.00,Europe
95,Latvia,1219,31,1045,143,0,0,0,2.54,85.73,2.97,1192,27,2.27,Europe
100,Liechtenstein,86,1,81,4,0,0,0,1.16,94.19,1.23,86,0,0.00,Europe
113,Monaco,116,4,104,8,0,0,0,3.45,89.66,3.85,109,7,6.42,Europe
143,San Marino,699,42,657,0,0,0,0,6.01,93.99,6.39,699,0,0.00,Europe
157,Spain,272421,28432,150376,93613,0,0,0,10.44,55.20,18.91,264836,7585,2.86,Europe

In [102]:
zero_case = covid[covid['New cases'] == 0]
zero_case[zero_case['WHO Region'] == 'Europe']

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
56,Estonia,2034,69,1923,42,0,0,1,3.39,94.54,3.59,2021,13,0.64,Europe
75,Holy See,12,0,12,0,0,0,0,0.00,100.00,0.00,12,0,0.00,Europe
95,Latvia,1219,31,1045,143,0,0,0,2.54,85.73,2.97,1192,27,2.27,Europe
100,Liechtenstein,86,1,81,4,0,0,0,1.16,94.19,1.23,86,0,0.00,Europe
113,Monaco,116,4,104,8,0,0,0,3.45,89.66,3.85,109,7,6.42,Europe
143,San Marino,699,42,657,0,0,0,0,6.01,93.99,6.39,699,0,0.00,Europe
157,Spain,272421,28432,150376,93613,0,0,0,10.44,55.20,18.91,264836,7585,2.86,Europe

### 3. 다음 [데이터](https://www.kaggle.com/neuromusic/avocado-prices)를 이용해 각 Region별로 아보카도가 가장 비싼 평균가격(AveragePrice)을 출력하면?

In [20]:
df = pd.read_csv('/jupyter/Data/Avocado/avocado.csv')
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [19]:
df['AveragePrice'].groupby(by=df['region']).max()

region
Albany                 2.13
Atlanta                2.75
BaltimoreWashington    2.28
Boise                  2.79
Boston                 2.19
BuffaloRochester       2.57
California             2.58
Charlotte              2.83
Chicago                2.30
CincinnatiDayton       2.20
Columbus               2.22
DallasFtWorth          1.90
Denver                 2.16
Detroit                2.08
GrandRapids            2.73
GreatLakes             1.98
HarrisburgScranton     2.27
HartfordSpringfield    2.68
Houston                1.92
Indianapolis           2.10
Jacksonville           2.99
LasVegas               3.03
LosAngeles             2.44
Louisville             2.29
MiamiFtLauderdale      3.05
Midsouth               2.17
Nashville              2.24
NewOrleansMobile       2.32
NewYork                2.65
Northeast              2.31
NorthernNewEngland     1.96
Orlando                2.87
Philadelphia           2.45
PhoenixTucson          2.62
Pittsburgh             1.83
Plains                 2.13
Portland               2.86
RaleighGreensboro      3.04
RichmondNorfolk        2.05
Roanoke                2.27
Sacramento             2.82
SanDiego               2.74
SanFrancisco           3.25
Seattle                2.96
SouthCarolina          2.21
SouthCentral           1.81
Southeast              2.33
Spokane                2.95
StLouis                2.84
Syracuse               2.44
Tampa                  3.17
TotalUS                2.09
West                   2.52
WestTexNewMexico       2.93
Name: AveragePrice, dtype: float64